CSI API ETABS v1

# cDesignStrip Interface

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public interface cDesignStrip

    Public Interface cDesignStrip

    Dim instance As cDesignStrip

    public interface class cDesignStrip

    type cDesignStrip =  interface end

The cDesignStrip type exposes the following members.

Methods

| Name| Description
---|---|---
|
ChangeName|  Changes the name of a
defined Design Strip
|
Delete|  Deletes the specified
Design Strip
|
GetDesignStrip|  Retrieves the
specified Design Strip
| [GetDesignStrip_1](69ff5ffb-d4aa-
cfd4-fef2-f22e99d9378f.htm)|  Retrieves the specified Design Strip
|
GetGUID|  Retrieves the GUID of an
existing strip
|
GetNameList|  Retrieves the names
of all defined Design Strips
|
SetGUID|  Sets the GUID of an
existing strip
Top

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com